TITLE LAB3
;---------------------------------------------------------------
; Архітектура комп'ютера
; Завдання:  Створити двовимірний масив array2Db, що складається з елементів в один байт,
; має розмір 16х16. Записати на діагональ масиву ініціали студентів групи.
; ВУЗ: 			КНУУ КПІ
; Факультет: 	ФІОТ
; Курс: 		1
; Група:		ІТ-03
;---------------------------------------------------------------
; Автори: Філянін, Хамад, Чабан
; Дата: 18.03.2021

;---------------------------ЗАГОЛОВОК ПРОГРАМИ------------------

	IDEAL			; Директива - тип Асемблера tasm
	MODEL small		; Директива - тип моделі пам'яті
	STACK 256		; Директива - розмір стеку в байтах

;---------------------------МАКРОСИ-----------------------------
; макрос для ініціалізації
MACRO M_Init 		; Початок макросу
	mov ax,@data 	; ax <- @data
	mov ds,ax 		; ds <- ax
	mov es,ax 		; es <- ax
ENDM M_Init 		; Кінець макросу
; макрос для переміщення в масиві
MACRO M_Increment
	inc si ; збільшуємо si на 1, просуваємося по горизонталі на 1
	add bx, 10h ; збільшуємо bx на 10, просуваємося по вертикалі на 10
ENDM M_Increment	
;---------------------------ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------

DATASEG
;Оголошення двовимірного масиву 16х16
; 22 - це код для "-" в ASCII
	array2Db db 22, 22 ,22 ,22 ,22 ,22 ,22 ,22 ,22 ,22 ,22 ,22 ,22 ,22 ,22 ,22
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
			db 0, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0
	exCode db 0  		; Код виходу

;----------------------IV. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------
CODESEG
	Start:
	M_Init					
	; використовуємо макрос
;-------------------------Ініціалізація DS і ES--------------------
	mov ax, @data ; @data ідентифікатор, що створюється директивою model
	mov ds, ax 	; Завантаження початку сегменту даних в регістр ds 
	mov es, ax ; Завантаження початку сегменту даних в регістр es
	mov si, 00h ; Індексний регістр пересування по горизонталі
	mov bx, 60h ; Базовий регістр пересування по вертикалі 
	; згідно з номером команди. У нашому випадку - 6

; Філянін Н.С. - виводимо FNS
; В ASCII F-46 N-4E S-53
	mov al, 046h 			; Записуємо до АL F
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос
	mov al, 04Eh 			; Записуємо до АL N
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос
		mov al, 053h 			; Записуємо до АL S
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос
;------------------------------------------------------------------
; Хамад І.А. - виводимо HEA
; B ASCII H-48 E-45 A-41
	mov al, 048h 			; Записуємо до АL H
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос
	mov al, 045h 			; Записуємо до АL E
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос
		mov al, 041h 			; Записуємо до АL A
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос
;------------------------------------------------------------------
; Чабан А.Є. - виводимо CAY
; B ASCII C-43 A-41 Y-59
	mov al, 043h 			; Записуємо до АL C
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос
	mov al, 041h 			; Записуємо до АL A
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос
		mov al, 059h 			; Записуємо до АL Y
	mov [array2Db+bx+si], al; M(DS*16+array2Db+BX+SI)
	M_Increment				; Виконується макрос	

;-------------------------Вихід з програми-------------------------
	mov ah, 4ch
	mov al, [exCode] ; отримання коду виходу
	int 21h ; виклик функції DOS 4ch
	end Start